export const regs = {
  // 手机号
  tel: /^1[3456789]\d{9}$/,
  // 18位身份证号
  idCard:
    /^[1-9][0-9]{5}(19|20)[0-9]{2}((01|03|05|07|08|10|12)(0[1-9]|[1-2][0-9]|31)|(04|06|09|11)(0[1-9]|[1-2][0-9]|30)|02(0[1-9]|[1-2][0-9]))[0-9]{3}([0-9]|x|X)$/,
  // 邮箱
  email: /^[A-Za-z\d]+([-_.][A-Za-z\d]+)*@([A-Za-z\d]+[-.])+[A-Za-z\d]{2,4}$/,
  // 整数
  int: /^\d+$/,
  // 整数和字母
  word: /^\w+$/,
  // 整数或最大一位小数
  oneDecimal: /^\d+(\.\d{1})?$/,
  // 整数或最大两位小数
  twoDecimal: /^\d+(\.\d{1,2})?$/,
  // 整数或最大两位小数，不含0
  twoDecimalNozero: /(^[1-9]\d*(\.\d{1,2})?$)|(^[0]\.\d{1,2}$)/,
};
